{
    "landing": {
        "title": "I am Diego Téllez, Software Engineer working as AI Applications Engineer",
        "career": "Currently working at",
        "company": "@LanguageWire",
        "companyUrl": "https://www.languagewire.com/en",
        "projects": "Check some of my",
        "github": "best projects",
        "profile": "Visit my",
        "linkedin": "LinkedIn"
    },
    "nav": {
        "home": "Home",
        "about": "About",
        "projects": "Projects"
    },
    "menu": {
        "home": "Home",
        "about": "About",
        "projects": "Live Projects"
    },
    "about": {
        "title": "Software Engineering and Development",
        "intro": "Hello, my name is Diego Tellez, and I am a passionate programmer with experience dating back to the early 2000s. My journey in programming began with an 800 hours course on functional and systems programming using C, followed by a deep dive into object-oriented programming with Java. My enthusiasm for learning extends beyond technology—I am also a trained pilot for merchant ships and have served as the second-in-command on a 150m long container vessel, I also love surfing and bodyboarding. My software development skills encompass a wide range of programming languages, including C, Java, Python, PHP, Swift, C#, Groovy, Bash, JavaScript, and TypeScript. I am proficient in building both backend and frontend services and microservices using frameworks such as NodeJS, Express, Deno, NestJS, Flask, Django, FastAPI, ReactJs and AngularJs. My expertise includes writing unit and integration tests with PyTest, UnitTest, Jest, Mocha, Crypress, Cucumber, building CI/CD pipelines using Jenkins and GithubActions, that made me proficient in Groovy and Bash scripting. I have substantial professional experience with AWS Services, particularly ElasticBeanstalk, EC2, X-ray, Cloudwatch, SystemsManager, Lambda, RDS, VPC, Auto-scaling, SNS, IAM, CloudFormation, CloudFront, and S3. Additionally, I have worked with containerization using Docker, orchestration with Kubernetes, and distributed event streaming platforms like Kafka. Recently, I have delved into Machine Learning and , gaining proficiency in Tensorflow and PyTorch, and I specialized myself in TinyML through a Professional Certificate program from Harvard University. I am currently practicing game development with monogame using .NET and C# as core technology.",
        "content": "I began my career in the tech sector as a Software Developer and have since advanced through a series of roles, including Front End Developer, Back End Developer, Solutions Architect, Full Stack Engineer, culminating in my current position as an AI Applications Engineer specialized in NLP Applications . \n\nMy responsibilities are multifaceted, involving the management and interaction with intricate distributed systems. This includes not only the implementation and maintenance of cutting-edge technological platforms but also the monitoring and addressing of critical alerts. Additionally, I provide specialized technical support to ensure the smooth operation and efficiency of software systems, a critical aspect in the fast-paced technology industry."
    }
}