{
    "landing": {
        "title": "I am Diego Téllez, Full Stack Engineer",
        "company": "@Stuart",
        "projects": "Check some of my",
        "github": "best projects",
        "profile": "Visit my",
        "download": "Download my"
    },
    "header": {
        "title": "WELCOME",
        "btn": "Navigate"
    },
    "about": {
        "title": "Software Engineering and Development.",
        "intro": "Hello, I am Diego Tellez and I am a coder. I have been programming since the early 2000's. My first experience with programming languages was learning functional and systems programming with C and after that I learned object oriented programming with Java. Since a really young age I have been hooked in learning and I consider myself a lifelong learner (I have been even been able to learn how to pilot merchant ships and have served as second in command of a merchant navy 150m long container vessel). I have created pieces of software in several programming languages such as C, Java, Python, PHP, Swift, Groovy, Bash, JavaScript and TypeScript. I have experience building backend and frontend microservices with frameworks like NodeJS, Express, Deno, NestJS, Flask, Django, ReactJs and AngularJs. I have experience writing unit and integration tests with PyTest, UnitTest, Jest, Mocha, Crypress, Cucumber. I have build CI/CD pipelines with Jenkins and I am profficient with Groovy and Bash. I have professional experience with AWS Services, Specially ElasticBeanstalk, EC2, X-ray, Cloudwatch, SystemsManager, Lambda, RDS, VPC, Auto-scaling, SNS, IAM, CloudFormation, CloudFront and S3. I have experience with containerization with Docker and orchestration with Kubernetes. I have also worked with distributed event streaming platforms like Kafka. I have recently starting studying Machine Learning and I am proficcient with Tensorflow and pyTorch and I am specialising myself in the field on TinyML while getting a Professional Certificate by Hardvard University.",
        "content": "I have recently joined the IT industry as a Software Developer and have worked as Front End Developer, Back End Developer, Solutions Architect and more recently as a Full Stack Engineer roles, enjoying my days engaged with complex distributed systems.",
        "achievements": "My biggest achievements as a proffesional Software Engineer have been:",
        "ach1": "Winner of the Best Project of the promotion at Neoland School; check the presentation in spanish",
        "prelink": " here.",
        "postlink": " This achievement granted be a Support Teacher role at the Coding School and a Freelance Contract as a Full Stack Developer; it was a seed to my later successes.",
        "ach2": "Main designer and developer of a Continuos Integration pipeline in Jenkins to allow Business Operation teams test their Python scripts before reaching production.",
        "ach3": "Leader of 'The Database CleanUp' project; it came to my attention that around 25% Applications from a NodeJs&React WebApps monorepo had an AWS t2.medium RDS Database created by default on the core app deployment pipeline. I suggested to refactor the pipeline to have the DB optionally created and started the process to delete the DB from 15 Web Apps deployed in AWS with sandbox, beta and production environments. The project was a success with 0 downtime and impact to costumers while reducing around 50k$/year our AWS bill.",
        "ach4": "Leader of the Grafana Automation Project; Built a script that would generate a Grafana dashboard for all the new applications deployed with the nodeJs stack. This script should handle previous existing app's dashboards and clone their already existing business metrics panels/rows. The project was a success and paved the way for a template base automatic dashboards management system that allow to update all the dashboard for all the company apps with changes on a templated JSON modeled dashboard"
    }
}