{
    "landing": {
        "title": "I am Diego Téllez, Full Stack Engineer",
        "company": "@Stuart",
        "projects": "Check some of my",
        "github": "best projects",
        "profile": "Visit my",
        "download": "Download my"
    },
    "header": {
        "title": "WELCOME",
        "btn": "Navigate"
    },
    "menu": {
        "home": "Home",
        "about": "About",
        "projects": "Live Projects"
    },
    "about": {
        "title": "Software Engineering and Development",
        "intro": "Hello, my name is Diego Tellez, and I am a passionate programmer with experience dating back to the early 2000s. My journey in programming began with an 800 hours course on functional and systems programming using C, followed by a deep dive into object-oriented programming with Java. My enthusiasm for learning extends beyond technology—I am also a trained pilot for merchant ships and have served as the second-in-command on a 150m long container vessel, I also love surfing and bodyboarding; I consider myself a waterman. My software development skills encompass a wide range of programming languages, including C, Java, Python, PHP, Swift, Groovy, Bash, JavaScript, and TypeScript. I am proficient in building both backend and frontend services and microservices using frameworks such as NodeJS, Express, Deno, NestJS, Flask, Django, FastAPI, ReactJs and AngularJs. My expertise includes writing unit and integration tests with PyTest, UnitTest, Jest, Mocha, Crypress, Cucumber, building CI/CD pipelines using Jenkins and GithubActions, that made me proficient in Groovy and Bash scripting. I have substantial professional experience with AWS Services, particularly ElasticBeanstalk, EC2, X-ray, Cloudwatch, SystemsManager, Lambda, RDS, VPC, Auto-scaling, SNS, IAM, CloudFormation, CloudFront, and S3. Additionally, I have worked with containerization using Docker, orchestration with Kubernetes, and distributed event streaming platforms like Kafka. Recently, I have delved into Machine Learning and , gaining proficiency in Tensorflow and PyTorch, and I specialized myself in TinyML through a Professional Certificate program from Harvard University. I am currently practicing game development with monogame using .NET and C# as core technology.",
        "content": "I have entered the IT industry as a Software Developer and progressed through various roles including Front End Developer, Back End Developer, Junior Solutions Architect, and recently as a Full Stack Engineer. My work involves engaging with complex distributed systems.",
        "achievements": "My most notable achievements as a professional Software Engineer include:",
        "ach1": "Being awarded the Best Project of the promotion at Neoland School. You can view the YouTube presentation in Spanish ",
        "prelink": " here.",
        "postlink": " This accomplishment led to a role as a Support Teacher at the Coding School I studied and a Freelance Contract as a Full Stack Developer collaborating to develop a smart greenhouse management mobile app and IoT system, laying the foundation for my subsequent successes.",
        "ach2": "Designing and developing a Continuous Integration pipeline in Jenkins that enabled Business Operation teams to test their Python scripts before deployment to production.",
        "ach3": "Leading 'The Database CleanUp' project, which identified that approximately 25% of Applications in a NodeJs&React WebApps monorepo were assigned an AWS t2.medium RDS Database by default. I spearheaded the refactoring of the deployment pipeline and the process to eliminate unnecessary databases across 15 web apps in AWS, resulting in zero downtime, no impact on customers, and a significant reduction of approximately $50,000/year in AWS expenses.",
        "ach4": "Heading the Grafana Automation Project, where I developed a script to generate Grafana dashboards for new applications deployed with the NodeJs stack. This script efficiently managed existing applications' dashboards, cloning their business metrics panels/rows. The success of this project led to the development of a template-based automatic dashboard management system, enabling updates across all company apps with changes to a templated JSON modeled dashboard.",
        "ach5": "Lead developer of the nodejs-packages monorepo project, that involved the extraction of a shared 'packages' folder from a monorepo of 60+ services. This new monorepo aimed to the independization of each of the packages to be published as a standalone npm package, the creation of a CI and a CD pipelines to publish them to an internal Nexus npm repository with cool features like an auto-revert feature to prevent unpublished code to linger in the main branch in case of publishing errors and opening a new PR with the reverted changes to allow developer to easily debug, fix and re-publish their updates."
    }
    
}