{
    "landing": {
        "title": "Soy Diego Téllez, Ingeniero de Software trabajando como Ingeniero de Aplicaciones de IA",
        "company": "@LanguageWire",
        "companyUrl": "https://www.languagewire.com/es-es",
        "projects": "Mira algunos de mis",
        "github": "mejores proyectos",
        "profile": "Visita mi"
    },
    "header": {
        "title": "BIENVENID@",
        "btn": "Navega"
    },
    "menu": {
        "home": "Inicio",
        "about": "Sobre mi",
        "projects": "Proyectos en vivo"
    },
    "about": {
        "title": "Ingeniería y Desarrollo de Software",
        "intro": "Hola, mi nombre es Diego Tellez y soy un programador con experiencia que se remonta a principios de la decada de los 2000 intentando. Mi trayectoria en la programación comenzó con la programación funcional y de sistemas usando C, seguido por una inmersión profunda en la programación orientada a objetos con Java. Mi entusiasmo por aprender va más allá de la tecnología: también soy piloto de la marina mercante certificado para manejar buques mercantes y he servido como segundo al mando buques portacontenedores de más de 150m de eslora y en petroleros. \nMis experiencia en desarrollo de software abarca una amplia gama de lenguajes de programación, incluyendo C, Java, Python, PHP, Swift, C#, Groovy, Bash, JavaScript y TypeScript. Soy competente en la construcción de servicios de backend y frontend y microservicios utilizando frameworks como NodeJS, Express, Deno, NestJS, Flask, Django, FastAPI, ReactJs y AngularJs. Mi experiencia incluye escribir pruebas unitarias e integradas con PyTest, UnitTest, Jest, Mocha, Crypress, Cucumber, construyendo pipelines de CI/CD usando Jenkins y GithubActions, lo que me hizo competente en scripting con Groovy y Bash. Tengo una experiencia profesional considerable con los Servicios de AWS, particularmente ElasticBeanstalk, EC2, X-ray, Cloudwatch, SystemsManager, Lambda, RDS, VPC, Auto-scaling, SNS, IAM, CloudFormation, CloudFront y S3. Además, he trabajado con contenerización usando Docker, orquestación con Kubernetes y plataformas de transmisión de eventos distribuidos como Kafka.\nRecientemente, me he interesado y formado en Machine Learning, adquiriendo competencia en Tensorflow y PyTorch, y he obtenido un Certificado Profesional de la Universidad de Harvard en 'Machine learning at the Edge' o TinyML gracias a un programa de estudio en remoto de EdX. Actualmente practico el desarrollo de juegos con monogame utilizando .NET y C# como tecnología principal.",
        "content": "He ingresado al sector Tech como Desarrollador de Software y he progresado a través de varios roles incluyendo Desarrollador de Front End, Desarrollador de Back End, Arquitecto de Soluciones, Ingeniero FullStack y recientemente como Ingeniero de Aplicaciones de Inteligencia Artifical trabajando principalmente con aplicacioens de Procesado de Lenguaje Natural. Mi trabajo implica la gestión e interacción con sistemas distribuidos complejos, abarcando la implementación y mantenimiento de plataformas tecnológicas avanzadas, la monitorización y respuesta a alertas críticas, y la provisión de soporte técnico especializado para asegurar la operatividad y eficiencia de los sistemas de software de empresas del sector tecnológico."
    }    
}